---
kind: property
id: P:Autodesk.Revit.DB.ModelCurve.IsReferenceLine
source: html/584e9179-174b-a180-d0d3-ceb0a9deaadc.htm
---
# Autodesk.Revit.DB.ModelCurve.IsReferenceLine Property

Indicates if this curve is a reference curve.

## Syntax (C#)
```csharp
public bool IsReferenceLine { get; }
```